Repository: AkmenZ/LoyaltyCardWalletApp
Catalog: lib/l10n/intl_*.arb
Languages: et, lt, lv

# cards
source: My Cards
et: Minu Kaardid
lt: Mano Kortelės
lv: Manas Kartes

# no_cards_yet
source: No cards yet. Add some!
et: Kaardid pole veel lisatud
lt: Kortelės dar nepridėtos
lv: Kartes vēl nav pievienotas

source: Edit Card
et: Muuda Kaarti
lt: Redaguoti Kortelę
lv: Rediģēt Karti

# add_card
source: Add New Card
et: Lisa Uus Kaart
lt: Pridėti Naują Kortelę
lv: Pievienot Jaunu Karti

source: Add Custom Card
et: Loo Kohandatud Kaart
lt: Sukurti Pasirinktą Kortelę
lv: Izveidot Pielāgotu Karti

source: Enter Manually
et: Sisesta Käsitsi
lt: Įvesti Rankiniu būdu
lv: Ievadīt Manuāli

source: Save
et: Salvesta
lt: Išsaugoti
lv: Saglabāt

source: Cancel
et: Tühista
lt: Atšaukti
lv: Atcelt

# confirm_continue
source: Continue
et: Jätka
lt: Tęsti
lv: Turpināt

source: Delete
et: Kustuta
lt: Ištrinti
lv: Dzēst

source: Share
et: Jaga
lt: Dalintis
lv: Kopīgot

# restore
source: Restore Data
et: Taasta Andmed
lt: Atkurti Duomenis
lv: Atjaunot Datus

source: Cloud Backup
et: Pilves Varundamine
lt: Debesų Atsarginė Kopija
lv: Mākoņa Dublēšana

source: Auto Backup
et: Automaatne Varundamine
lt: Automatinė Atsarginė Kopija
lv: Datu Dublēšana

# auto_backup_description
source: Automatically save changes in Your account
et: Muudatuste automaatne salvestamine Teie kontol
lt: Automatiškai išsaugoti pakeitimus jūsų paskyroje

# backup_enabled
source: Backup enabled and data saved
et: Varundamine lubatud ja andmed salvestatud
lt: Atsarginė kopija įjungta ir duomenys išsaugoti
lv: Dublēšana ieslēgta un dati saglabāti

source: Backup disabled
et: Varundamine keelatud
lt: Atsarginė kopija išjungta
lv: Dublēšana izslēgta

source: Barcode
et: Triipkood
lt: Brūkšninis Kodas
lv: Svītrkods

# note
source: Note (optional)
et: Märkus (valikuline)
lt: Pastaba (neprivaloma)
lv: Piezīme (pēc izvēles)

source: Name
et: Nimi
lt: Pavadinimas
lv: Nosaukums

source: Scan
et: Skaneeri
lt: Skenuoti
lv: Skenēt

# confirm_delete_card
source: Are you sure you want to delete this card?
et: Kas oled kindel, et soovid selle kaardi kustutada?
lt: Ar tikrai norite ištrinti šią kortelę?
lv: Vai tiešām vēlaties dzēst šo karti?

# confirm_restore_data
source: This action will override Your currently saved loyalty cards, if previously saved backup data exists. Are you sure you want to proceed?
et: See toiming kirjutab üle Teie praegu salvestatud lojaalsuskaardid, kui varem salvestatud varukoopiaandmed on olemas. Kas olete kindel, et soovite jätkata?
lt: Šis veiksmas perrašys jūsų šiuo metu išsaugotas lojalumo korteles, jei yra anksčiau išsaugotų atsarginių duomenų. Ar tikrai norite tęsti?
lv: Ja iepriekšējie dublējuma dati ir piejami, jūsu pašlaik saglabātās lojalitātes kartes tiks pārrakstītas. Vai tiešām vēlaties turpināt?

# please_enter_name
source: Please enter a name!
et: Palun sisesta nimi!
lt: Prašome įvesti pavadinimą!
lv: Lūdzu, ievadiet nosaukumu!

# please_enter_barcode
source: Please enter a barcode!
et: Palun sisesta triipkood!
lt: Prašome įvesti brūkšninį kodą!
lv: Lūdzu, ievadiet svītrkodu!

# position_barcode
source: Position the barcode within the frame to scan
et: Skaneerimiseks suuna triipkood raami
lt: Norėdami nuskaityti, nukreipkite brūkšninį kodą į rėmelį
lv: Lai noskanētu, notēmējiet svītrkodu rāmī

source: Pick from Gallery
et: Vali galerii
lt: Pasirinkti iš galerijos
lv: Izvēlēties no galerijas

source: No barcode found
et: Triipkoodi ei leitud
lt: Brūkšninis kodas nerastas
lv: Kods nav atrasts

# could_not_read_barcode
source: Could not read the barcode from this image
et: Triipkoodi sellest pildist ei õnnestunud lugeda
lt: Nepavyko nuskaityti brūkšninio kodo iš šio vaizdo
lv: Kods no šī attēla nav nolasāms

source: Failed to analyze image
et: Pildi analüüsimine ebaõnnestus
lt: Nepavyko analizuoti vaizdo
lv: Neizdevās izanalizēt attēlu

source: Failed to load image
et: Pildi laadimine ebaõnnestus
lt: Nepavyko įkelti vaizdo
lv: Neizdevās ielādēt attēlu

source: Error
et: Viga
lt: Klaida
lv: Kļūda

source: Success
et: Edu
lt: Viskas yra izdevies
lv: Viss ir izdevies

source: Card added successfully
et: Kaart on edukalt lisatud
lt: Kortelė sėkmingai pridėta
lv: Karte pievienota

source: Card updated successfully
et: Kaart on edukalt uuendatud
lt: Kortelė sėkmingai atnaujinta
lv: Karte atjaunināta

source: Card deleted successfully
et: Kaart on edukalt kustutatud
lt: Kortelė sėkmingai ištrinta
lv: Karte dzēsta

source: Cards restored successfully
et: Kaardid on edukalt taastatud
lt: Kortelės sėkmingai atstatytos
lv: Kartes atjaunotas veiksmīgi
